package com.wengan.Homework.PersonSystem;

/**
 * @author 文淦
 * @version 1.0
 */

/*
        给出以下场景，请写出相关的面向对象编程的代码：
        需要编写一个北交大的人员管理系统，管理的人员包括：
        学生(本科、硕士、博士)、教师（讲师、教授）、后勤人员（宿管和保安）。

        所有的人员具有相同属性：年龄、性别、电话、籍贯；相同的爱好：运动。

        不同类的人员含有不同的属性和职能，
            学生有学历、所属学院属性和上课的职能，
            教师有职称、所属学院属性和授课的职能，
            后勤人员有编制属性(在编和非在编)和后勤保障的职能。

        同一类人的不同细分也具有不同的属性或职能，举例：
            1.本科生需要写毕设、硕士需要发 ei，博士需要发 sci；
            2.讲师专注于上课，教授专注于科研；
            3.宿管需要查寝，保安需要巡逻
 */
public class Test {
    public static void main(String[] args){

    }
}
